# Параметры подключения к ClickHouse
CLICKHOUSE_CONFIG = {
    'host': 'localhost',
    'port': 9000,
    'user': 'default',
    'password': '',
    'database': 'default',
    'secure': False
}

# Настройки генерации данных
DATA_GENERATION_CONFIG = {
    'num_rows': 5_000_000,  # Минимум 5 миллионов строк
    'batch_size': 100_000,   # Размер батча для загрузки
    'start_date': '2025-01-01',
    'end_date': '2025-12-31'
}

# Списки возможных значений
CITIES = [
    'Москва', 'Новосибирск', 'Тула', 'Санкт-Петербург', 
    'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск',
    'Омск', 'Самара', 'Ростов-на-Дону', 'Уфа', 'Красноярск',
    'Воронеж', 'Пермь', 'Волгоград', 'Краснодар', 'Саратов',
    'Тюмень', 'Ижевск'
]

EVENTS = ['view', 'purchase', 'add_to_cart']
DEVICE_OS = ['Android', 'iOS']